Repository: kurekmartin/TeamSorting
Catalog: TeamSorting/Lang/Resources.*.resx
Languages: cs_cz

# InputView_AddDiscipline_Button
source: Add Discipline
cs_cz: Přidat disciplínu

# InputView_DataGrid_ColumnHeader_Name
source: Name
cs_cz: Jméno

# InputView_DataGrid_ColumnHeader_NotWith
source: Not with
cs_cz: Nesmí být s

# InputView_DataGrid_ColumnHeader_With
source: With
cs_cz: Musí být s

# InputView_LoadData_FileDialog
source: Load from file
cs_cz: Načíst ze souboru

# InputView_NewDiscipline_Watermark
source: New discipline name
cs_cz: Název disciplíny

# InputView_NewMember_Button
source: Add member
cs_cz: Přidat člena

# InputView_NewMember_TextBox_Watermark
source: Member name
cs_cz: Jméno

# InputView_RemoveDiscipline_Button
source: Remove discipline
cs_cz: Odstranit disciplínu

# InputView_RemoveMember_Button_Tooltip
source: Remove Member
cs_cz: Odstranit člena

# InputView_Seed_Watermark
source: Seed
cs_cz: Semínko

# InputView_Sort_WarningDialog_Message
source: All teams will be deleted and replaced with new ones. Do you want to delete current teams?
cs_cz: Aktuální kombinace členů bude zahozena. Chcete zahodit aktuální kombinaci členů?

# TeamsView_ExportTeamsToCsv_FileDialogTitle
source: Export Teams to CSV
cs_cz: Exportovat týmy do CSV

# InputView_LoadData_Button
source: Load data
cs_cz: Načíst data

# InputView_SortToTeams_Button
source: Sort to teams
cs_cz: Rozdělit do týmů

# TeamsView_Back_Button
source: Back
cs_cz: Zpět

# TeamsView_ExportToCSV_Button
source: Export teams to CSV
cs_cz: Exportovat týmy do CSV

# TeamsView_ShowMemberDetails_Label
source: Show member details
cs_cz: Zobrazit detaily členů

# TeamsView_Differences_Label
source: Team differences:
cs_cz: Rozdíly mezi týmy:

# TeamsView_Seed_Label
source: Seed
cs_cz: Semínko

# TeamsView_TeamIsValid_ToolTip
source: Team is valid: {0}
cs_cz: Tým je platný: {0}

# Data_TeamName_Template
source: Team{0}
cs_cz: Tým{0}

# WarningDialog_Cancel_Button
source: Cancel
cs_cz: Zrušit

# WarningDialog_Confirm_Button
source: Continue
cs_cz: Pokračovat

# Enum_DisciplineDataType_Number
source: Number
cs_cz: Číslo

# Enum_DisciplineDataType_Time
source: Time
cs_cz: Čas

# Enum_SortOrder_Asc
source: Asc
cs_cz: Vzestupně

# Enum_SortOrder_Desc
source: Desc
cs_cz: Sestupně

# Bool_False
source: False
cs_cz: Ne

# Bool_True
source: True
cs_cz: Ano

# Data_LoadFromFile_Error
source: Error reading data from file
cs_cz: Chyba čtení dat ze souboru

# Data_LoadFromFile_Success
source: Successfully loaded data from file
cs_cz: Data ze souboru úspěšně načtena

# Data_ValidateCsvHeader_MissingColumns_Error
source: Header doesn't contain columns:
cs_cz: Hlavička neobsahuje následující sloupce:

# Data_ValidateCsvHeader_DuplicateColumns_Error
source: Header contains duplicate columns:
cs_cz: Hlavička obsahuje duplicitní sloupce:

# Data_ReadDisciplineDataTypes_WrongDisciplineDataTypes_Error
source: Unknown data type '{0}' for discipline '{1}' Valid values: {2}
cs_cz: Neznámý datový typ '{0}' disciplíny '{1}' Platné hodnoty: {2}

# Data_ReadDisciplineDataTypes_ReadingError
source: Error reading data type for discipline {0} {1}
cs_cz: Chyba čtení datového typu disciplíny {0}

# Data_ReadDisciplineSortTypes_WrongDisciplineSortOrder_Error
source: Unknown sort order '{0}' for discipline '{1}' Valid values: {2}
cs_cz: Neznámé řazení '{0}' disciplíny '{1}' Platné hodnoty: {2}

# Data_LoadMembersData_DuplicateMemberNames_Error
source: Member with name {0} already exists.
cs_cz: Člen se jménem {0} již existuje.

# Data_LoadMembersData_DuplicateMembersInConstarins_Warning
source: Found duplicate members in combination constrains
cs_cz: Nalezen duplicitní člen v podmínkách kombinací členů

# Data_LoadMembersData_UnknownMemberInConstrains_Error
source: Found unknown members in combination constrains: {0}
cs_cz: Nalezeni neznámí členové v podmínkách kombinací členů: {0}

# Data_LoadMembersData_WrongDisciplineRecordFormat_Error
source: Wrong format of discipline record value. Expected format is {0}
cs_cz: Chybný formát hodnoty záznamu disciplíny. Očekávaný formát je {0}

# Data_LoadMembersData_DisciplineRecord_UnknownError
source: Error reading value of discipline record: {0}
cs_cz: Chyba čtení hodnoty záznamu disciplíny

# Data_LoadMembersData_EmptyMemberName_Error
source: Found empty member name.
cs_cz: Nalezeno prázné jméno.

# CsvErrorDialog_Title
source: Error loading data from CSV
cs_cz: Chyba při načítání dat z CSV

# CsvErrorDialog_Grid_ColumnNumber_Header
source: Column
cs_cz: Sloupec

# CsvErrorDialog_Grid_RowNumber_Header
source: Row
cs_cz: Řádek

# CsvErrorDialog_Grid_Error_Header
source: Error
cs_cz: Chyba

# TeamsView_CsvExport_Success
source: File saved successfully.
cs_cz: Soubor byl úspěšně uložen.

# TeamsView_CsvExport_Error
source: Error saving file: {0}
cs_cz: Chyba při ukládání souboru: {0}

# InputView_ShowTeams_Button
source: Show teams
cs_cz: Zobrazit týmy

# InputView_Sort_WarningDialog_Cancel
source: Cancel
cs_cz: Zrušit

# InputView_Sort_WarningDialog_Delete
source: Delete
cs_cz: Smazat

# InputView_DeleteData_WarningDialog_Message
source: All data will be deleted (members, teams, disciplines). Do you want to continue?
cs_cz: Všechna data budou smazána (členové, týmy, disciplíny). Chcete pokračovat?

# InputView_DeleteData_WarningDialog_Delete
source: Delete
cs_cz: Smazat

# InputView_DeleteData_WarningDialog_Cancel
source: Cancel
cs_cz: Zrušit

# MemberListSelection_Search
source: Search
cs_cz: Hledat

# InputView_Member_EmptyName_Error
source: Name cannot be empty
cs_cz: Jméno nemůže být prázdné

# InputView_Member_DuplicateName_Error
source: Member with same name exists
cs_cz: Člen se stejným jménem již existuje

# TeamsView_MemberMoved_Message
source: Member **{0}** moved from team **{1}** to team **{2}**.
cs_cz: Člen **{0}** přesunut z týmu **{1}** do týmu **{2}**.

# Data_TeamName_Unsorted
source: Unsorted
cs_cz: Nezařazení

# TeamsView_AddTeam_Button
source: Add team
cs_cz: Přidat tým

# InputView_DeleteData_Button
source: Delete data
cs_cz: Smazat data

# TeamsView_CreateNewCombination_Button
source: Create new combination
cs_cz: Vytvořit novou kombinaci

# Sorting_ProgressText
source: Sorting in progress...
cs_cz: Probíhá rozřazení...

# TeamsView_DisciplineAverages_Label
source: Discipline averages:
cs_cz: Průměry disciplín:

# DisciplineInfo_Priority
source: Priority
cs_cz: Priorita

# Data_ValidateCsvHeader_MissingHeader
source: Header is missing
cs_cz: Chybí hlavička souboru
